Revit 2024 API
DataTransferProgressChangedEventArgs.TotalSize Property
 Total expected data size to transfer, in bytes.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public double TotalSize { get; }
Visual Basic
Public ReadOnly Property TotalSize As Double
	Get
Visual C++
public:
property double TotalSize {
	double get ();
}
See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace